<template>
  <div>
    <van-sticky>
      <div style="text-align: center;background-color: white">
        <van-row>
          <van-col span="24" style="text-align: center"><span style="line-height: 0.5rem;">Circle软件许可及服务协议</span>
          </van-col>

        </van-row>
        <van-divider/>
      </div>
    </van-sticky>
    <div id="page" class="site">
      <div class="site-inner">

        <header id="masthead" class="site-header" role="banner">
          <div class="site-header-main">
            <div class="site-branding">

              <p class="site-title"><a href="https://post.Circle.club/" rel="home"></a></p>
            </div><!-- .site-branding -->

          </div><!-- .site-header-main -->

        </header><!-- .site-header -->

        <div id="content" class="site-content">

          <div id="primary" class="content-area">
            <main id="main" class="site-main" role="main">

              <article id="post-5" class="post-5 page type-page status-publish hentry">
                <div class="entry-header">
                  <h1 class="entry-title"></h1></div>

                <div class="entry-content">

                  <p> 《Circle软件许可及服务协议》（以下简称“本协议”）是由您与“Circle”产品服务提供方（以下简称为“Circle”提供方）就使用“Circle”产品和服务所达成的协议。<strong>在您开始使用“Circle”产品和服务之前，请您务必审慎阅读本协议及“Circle”提供方公布的<a
                    href="https://post.Circle.club/privacy/">《隐私政策》</a>，并充分理解各条款内容，特别是涉及限制或者免除责任的条款。限制、免除责任条款将以对字体进行加粗的形式提示您注意。</strong>
                  </p>

                  <p><strong>除非您完全接受本协议的全部内容，否则您应停止使用“Circle”产品及相关服务。您下载、安装“Circle”产品后使用前应审慎阅读本协议及“Circle”提供方公布的《隐私政策》，并自主选择是否同意相关内容，如果您不同意相关内容，您应停止使用“Circle”产品和服务。选择同意则表示您已充分理解并同意签署本协议，承诺作为协议的一方当事人接受协议的约束。</strong>
                  </p>

                  <p><strong>如果您是未满18周岁的未成年人，请在法定监护人的陪同下阅读本协议，并应在使用我们的产品及服务前取得监护人的同意。如您是未成年人的父母或监护人，您在同意被监护人使用我们的产品或服务前，应详细阅读本协议的所有内容。</strong>
                  </p>

                  <p><strong>如有任何疑问或建议，您可以将相关内容发送至：</strong><strong><a href="mailto:ifjellow@gmail.com">ifjellow@gmail.com</a></strong>
                  </p>

                  <p><strong>我们收到您的问题并核实您的身份后，将对您的反馈进行处理并及时向您答复。</strong><strong></strong></p>

                  <h2><strong>1.&nbsp;</strong><strong>协议范围</strong></h2>

                  <p>1.1&nbsp;本协议约定了“Circle”提供方和用户之间就使用“Circle”产品和服务事宜发生的权利义务关系。</p>

                  <p>1.2&nbsp;“Circle”提供方：是指“Circle”产品的权属所有人及其运营人，但就本协议涉及、及“Circle”产品将来可能涉及的某些服务项目，“Circle”提供方的关联方也可能向您提供产品和服务，与您发生权利义务关系。</p>

                  <p>1.3&nbsp;您：又称“用户”，是指任何以合法方式获取和使用“Circle”产品的人，不限于自然人或机构。</p>

                  <p>1.4&nbsp;Jellow产品：又称“Circle”或“Jellow软件”，是指由“Circle”提供方合法拥有并运营的、标注名称为“Circle”的移动客户端应用程序以及对应的域名为&nbsp;“Circle.site”&nbsp;的移动网站。客户端应用程序以软件形式提供，包括但不限于iOS、Android等多个版本，您须选择与所安装终端设备相匹配的软件版本。</p>

                  <p>1.5&nbsp;Jellow服务：指“Circle”提供方向您提供的与“Circle”产品相关的各项运营服务。</p>

                  <p>1.6&nbsp;本协议内容同时包括“Circle”提供方及其关联方可能不断发布的关于“Circle”产品和服务的业务规则、相关协议及其修订版本等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。</p>

                  <p><strong>1.7
                    “Circle”提供方有权将本服务或本协议项下之权利义务委托给其关联方或其他第三方进行运营、管理及履行，“Circle”提供方无需就此向您再行获取授权。届时，“Circle”提供方将竭尽避免前述委托或变更给“Circle”产品相关的各项服务造成的不便。</strong>
                  </p>

                  <h2><strong>2.&nbsp;产品与服务</strong></h2>

                  <p>2.1&nbsp;用户应从合法的渠道下载“Circle”产品至其合法拥有的终端设备中。同时，我们提示您：</p>

                  <p>2.1.1“Circle”提供方给予您一项个人的、不可转让及非排他性的许可，以使用“Circle”产品及服务，您可以非商业目的在终端设备上安装、使用
                    “Circle”产品，“Circle”提供方也保留在任何必要情形下收回该授权的权利。但除非得到特别的授权，否则，您不应也不得以任何形式改编、复制或交易“Circle”产品。</p>

                  <p><strong>2.1.2
                    如果您从未经“Circle”提供方授权的第三方获取“Circle”产品或与“Circle”产品名称相同的安装程序，“Circle”提供方无法保证该产品能够正常使用，并且，“Circle”提供方不对因此造成的任何损失负责。</strong>
                  </p>

                  <p>2.2&nbsp;一旦用户在其终端设备中打开“Circle”产品，即视为使用“Circle”产品和服务。为充分实现“Circle”产品及服务的全部功能，用户可能需要将其终端设备联网。</p>

                  <p>2.3&nbsp;为了保证“Circle”产品和服务的安全性和功能的一致性，“Circle”提供方有权不经向用户特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。</p>

                  <p>2.4 “Circle”软件新版本发布后，旧版本的软件可能无法使用。“Circle”提供方不保证旧版本软件继续可用，请您随时核对并下载最新版本。</p>

                  <p>2.5&nbsp;用户理解并同意：为了提供有效的服务，“Circle”会利用用户终端设备的处理器和带宽等资源。“Circle”使用过程中可能会产生数据流量费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。</p>

                  <p>2.6&nbsp;您在注册账号或使用本服务的过程中，需要提供一些必要的信息，例如：为向您提供账号注册服务或进行用户身份识别，您需要填写手机号码；部分定位功能需要您同意使用您所在的地理位置信息；收集通讯录匹配功能需要您授权访问手机通讯录等。若国家法律法规或政策有特殊规定，需要您提供真实的身份信息的，则若您拒绝提供信息或您提供的信息不完整，则无法使用对应功能或在使用的过程中受到限制。</p>

                  <p>2.7
                    “Circle”提供方将采取合适的安全措施及技术手段保护您的个人信息及其他数据安全。对个人信息及与个人信息相关的数据资料的存储，“Circle”提供方严格按照法律规定的执行方式及期限执行，对不同等级的个人信息按照其对应的存储期限进行存储。</p>

                  <p><strong>2.8 &nbsp;</strong><strong>您在使用本软件及服务时，须自行承担如下“</strong><strong>Circle</strong><strong>”提供方不可掌控的风险内容，包括但不限于：</strong><strong></strong>
                  </p>

                  <p><strong>2.8.1</strong><strong>由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；</strong><strong></strong></p>

                  <p>
                    <strong>2.8.2</strong><strong>用户必须选择与所安装终端设备匹配的软件版本，否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担；</strong><strong></strong>
                  </p>

                  <p>
                    <strong>2.8.3</strong><strong>用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，</strong><strong>由用户自行承担；</strong><strong></strong>
                  </p>

                  <p><strong>2.8.4</strong><strong>用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；</strong><strong></strong></p>

                  <p>
                    <strong>2.8.5</strong><strong>由于无线网络信号不稳定、无线网络带宽小等原因，所引起的登录失败、资料同步不完整、页面打开速度慢等风险。</strong><strong></strong>
                  </p>

                  <p><strong>2.9</strong><strong>您理解并同意，“</strong><strong>Circle</strong><strong>”提供方将会尽其商业上的合理努力保障您于本软件及服务中的数据存储安全，但是，“</strong><strong>Circle</strong><strong>”提供方并不能就此完全保证，包括但不限于以下情形：</strong><strong></strong>
                  </p>

                  <p><strong>2.9.1</strong><strong>“</strong><strong>Circle</strong><strong>”提供方不对您在本软件及服务中相关数据的删除或存储失败负责；</strong><strong></strong>
                  </p>

                  <p><strong>2.9.2</strong><strong>在符合相关法律法规规定的前提下，“</strong><strong>Circle</strong><strong>”提供方有权根据实际情况自行决定单个用户在本软件及服务中的数据的最长存储期限，并在服务器上为其分配最大存储空间；</strong><strong></strong>
                  </p>

                  <p><strong>2.9.3如果您停止使用本软件及服务或服务被终止或取消，“Circle”提供方可以在保存期限（如有）届满后从服务器上永久地删除您的数据。服务停止、终止或取消后，“Circle”提供方没有义务向您返还数据。</strong>
                  </p>

                  <p><strong>2.10
                    请用户注意勿在使用“Circle”产品和服务时随意透露您或他人的各类财产帐户、银行卡、信用卡、第三方支付账户及对应密码等重要资料，否则由此带来的任何损失由用户自行承担。</strong></p>

                  <p>
                    2.11您理解并同意，“Circle”提供方有权决定将本软件作商业用途，包括但不限于开发、使用本软件的部分服务为第三方推广等。在推广的过程中，“Circle”提供方将严格按照相关法规及“Circle”提供方针对“Circle”发布的规范保护您的个人信息，同时间，您亦可以根据系统设置选择屏蔽、拒绝接收相关推广信息。 </p>

                  <h2><strong>3.&nbsp;账号和用户行为</strong></h2>

                  <p>3.1
                    “Circle”为用户提供了注册通道，用户有权选择合法并符合规定的字符组合作为自己的账号识别信息，并自行设置符合安全要求的密码。用户设置的账号、密码是用户用以登录“Circle”产品，并以注册用户身份使用产品或接受服务的凭证。“Circle”账号的所有权归属“Circle”提供方，用户完成申请注册手续后，仅获得账号的使用权，且该使用权仅属于初始申请注册人。</p>

                  <p><strong>&nbsp;3.2&nbsp;用户充分了解并同意，用户必须为自己注册账号下的一切行为负责，包括所发表的任何内容以及由此产生的任何后果。“Circle”提供方作为服务提供者会依照相关规定履行审核及基本保护义务，但基于各种我们无法预测及控制的因素，我们特别提示您，您在使用“Circle”产品及服务的过程中，应对“Circle”产品和服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。“Circle”提供方不会对因前述风险而导致的任何损失或损害承担责任。</strong>
                  </p>

                  <p><strong>3.3&nbsp;您在“Circle”中的注册账号仅限于您本人使用，禁止赠与、借用、出租或售卖，否则“Circle”提供方有权在未经提前通知的情况下，暂停或终止向该注册账号提供服务，并有权注销该账号，由此带来的包括用户通讯中断、用户资料和信息等清空等损失由用户自行承担。</strong>
                  </p>

                  <p><strong>3.4用户有责任妥善保管注册账号信息及账号密码的安全，用户需要对注册账号及密码下的行为承担法律责任，包括用户数据的修改、评论发表以及其他在“Circle”产品上的操作行为。若发现他人未经许可使用您的账号或您的账号下发生其他任何安全漏洞问题时，您应立即通知“Circle”提供方。</strong>
                  </p>

                  <p>
                    3.5除自行注册“Circle”账号外，用户也可选择通过“Circle”的账号关联系统使用其合法拥有的其他账号注册登录“Circle”产品（具体支持以届时的登录设置为准）。用户以上述已有账号进行注册的，对应于“Circle”中生成的账号同样适用本协议中对账号的相关约定。</p>

                  <p><strong>3.6&nbsp;用户注册“Circle”账号后如果连续120日及以上时长未进行实际使用的，“Circle”提供方有权回收该账号，以免造成资源浪费。</strong></p>

                  <p><strong>3.7 用户在使用“Circle”产品和服务时，应当遵守中华人民共和国的法律。用户不得利用“Circle”提供方的产品和服务从事违反相关法律法规、政策的行为并应遵守
                    “Circle”产品内发布或更新的规则规范。用户不得通过头像、用户名、昵称、网址、自述等个人资料冒充他人身份，无论是否发布信息。如果遇到违反情形，“Circle”提供方保留收回相关账号的权利。</strong>
                  </p>

                  <p><strong>3.78
                    用户在“Circle”发表的内容仅表明其个人的立场和观点，并不代表“Circle”提供方的立场或观点。作为内容的发表者，用户需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。“Circle”提供方不承担任何法律及连带责任。</strong>
                  </p>

                  <p>3.9&nbsp;用户不得使用未经“Circle”提供方授权或许可的任何插件、“外挂”或第三方工具对“Circle”产品和服务的正常运行进行干扰、破坏、修改或施加其他影响。</p>

                  <p>3.10&nbsp;用户不得利用或针对“Circle”产品进行任何危害计算机网络安全的行为，包括但不限于：未经许可使用“Circle”的相关数据或在未经许可的情形下进入“Circle”的相关服务器/帐户；未经许可，企图探查、扫描、测试“Circle”产品系统或网络的弱点或实施其它破坏网络安全的行为；企图干涉、破坏“Circle”产品系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据包名称或部分名称。</p>

                  <p>3.11&nbsp;未经“Circle”提供方许可，您不得在“Circle”产品中进行任何诸如发布广告、销售商品等商业行为。</p>

                  <p><strong>3.12&nbsp;</strong>“Circle”提供方致力营造文明、理性、友善、高质量的平台氛围。在平台服务功能发展的同时，我们将不断加强相应的信息安全管理能力，切实履行社会责任。<strong>用户不得利用“Circle”提供方的产品和服务制作、复制、发表、传播下列信息（包括但不限于通过发布评论、修改昵称等形式）：</strong>
                  </p>

                  <p><strong>3.12.1</strong><strong>发布、传送、传播、储存国家法律法规禁止的内容：</strong><strong></strong></p>

                  <p>（1）反对宪法确定的基本原则的；</p>

                  <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>

                  <p>（3）损害国家荣誉和利益的；</p>

                  <p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>

                  <p>（5）破坏国家宗教政策，宣扬邪教和迷信的；</p>

                  <p>（6）散布谣言，扰乱社会秩序、破坏社会稳定的；</p>

                  <p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>

                  <p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>

                  <p>（9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；</p>

                  <p>（10）以非法民间组织名义活动的；</p>

                  <p>（11）含有法律、行政法规禁止的其他内容的。</p>

                  <p>
                    <strong>3.12.2 </strong><strong>发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权益的内容的；</strong><strong></strong>
                  </p>

                  <p><strong>3.12.3 </strong><strong>涉及他人隐私、个人信息或资料的；</strong><strong></strong></p>

                  <p><strong>3.12.4 </strong><strong>发表、传送、传播骚扰、广告信息、过度营销信息及垃圾信息或其他同类信息的；</strong><strong></strong></p>

                  <p><strong>3.12.5 </strong><strong>其他违反法律法规、政策及公序良俗、社会公德或干扰“</strong><strong>Circle</strong><strong>”正常运营、侵犯其他用户或第三方合法权益的信息。</strong><strong></strong>
                  </p>

                  <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>对违反上述条款的用户，“Circle”提供方将视情况采取拒绝发布、删除评论、短期禁止发言直至永久关闭账号等管理措施，涉嫌违法犯罪的内容将被保存在案、并在接受有关政府部门调查时如实报告。</strong>
                  </p>

                  <p>3.13&nbsp;”Circle”提供方将完善公众举报平台，欢迎用户监督举报各类不法传播活动和违法有害信息，以共同营造清朗的网络空间。 </p>

                  <h2><strong>4.&nbsp;知识产权</strong></h2>

                  <p>4.1&nbsp;“Circle”提供方是“Circle”产品的知识产权权利人。“Circle”的一切著作权、商标权、专利权、商业秘密等知识产权，以及与“Circle”相关的所有信息内容（包括但不限于文字、图片、视频、音频、界面设计、版权框架等）均受中华人民共和国法律法规和相应国际条约的保护，“Circle”提供方享有上述知识产权（相关权利人依照法律规定应当享有的权利除外）。</p>

                  <p><strong>4.2&nbsp;您应保证，在使用“Circle”产品和服务时上传的文字、图片、音频、视频以及其他信息不侵犯任何第三方知识产权。否则，“Circle”提供方有权移除该侵权信息，并对此不负任何责任。如前述第三方提出权利主张，用户应自行承担责任，并保证“Circle”提供方不会因此而遭受任何损失。</strong>
                  </p>

                  <p><strong>4.3&nbsp;您在使用“Circle”产品及服务过程中上传、发布的全部内容，均不会因此上传、发布行为发生知识产权、肖像权等权利的转移。与此同时，您理解并同意，您在使用“Circle”产品和服务时将相关文字、图片、音频、视频等内容发表、上传于“Circle”后，您的发表、上传行为表明您将该信息对“Circle”提供方进行了非独占性、永久性和可转让的授权。“Circle”提供方有权免费地将您发表、上传的内容在法律规定的范围内进行使用（包括进行传播、改编、剪辑等），“Circle”提供方可将上述信息在“Circle”中使用，可在”Circle”提供方的其他产品中使用，也可以由“Circle”提供方授权给合作方使用。</strong>
                  </p>

                  <p>4.4&nbsp;
                    “Circle”产品和服务中可能涉及到第三方知识产权，而该第三方对于您在“Circle”产品和服务中使用相关知识产权有要求时，“Circle”提供方将以适当形式告知您该要求，您应当一并遵守。</p>

                  <p>4.5&nbsp;未经相关权利人同意，用户不得对“Circle”产品和服务涉及的相关网页、应用、软件等产品进行反向工程、反向汇编、反向编译等；也不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。</p>

                  <p style="text-align:left">4.6&nbsp;“Circle”产品和服务中所包含内容的知识产权均受到法律保护，未经“Circle”提供方、用户或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。</p>

                  <h2><strong>5.&nbsp;个人信息和隐私保护</strong></h2>

                  <p>5.1 保护用户的个人信息是“Circle”提供方的一项基本原则，“Circle”提供方将按照本协议及“Circle”提供方公布的<strong>《隐私政策》</strong>的规定收集、使用、存储和分享您的个人信息。
                  </p>

                  <p>5.2
                    维护软件安全与正常使用是“Circle”提供方与您的共同责任，“Circle”提供方将按照行业标准审慎采取必要措施保护您的设备信息和数据安全，但是同时，您应了解并认可“Circle”提供方无法就此向您提供完全的保证。在我们与您共同维护维护您的个人信息安全的同时，您也应该尊重他人的合法权益且不应以任何方式侵害他人，如您不应也不得制作、发布、使用、传播任何用于窃取他人账号及他人个人信息、财产的恶意程序。</p>

                  <p>5.3
                    您理解并同意，“Circle”同大多数互联网软件一样，可能会受到多种因素的影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能被他人非法利用信息资料等各种安全问题侵扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全等。因此，您应加强信息安全及个人信息的保护意识，注意个人信息及帐户密码的保护，以免遭受损失。<strong>在此，我们特别提示您，在任何情况下，您都不应轻信借款、索要密码或任何其他涉及财产及个人身份信息的网络信息。涉及个人信息提供及财产操作的，请先核实对方身份，“Circle”不对也无法对相关向您索要信息的主体进行核实也不会对因此产生的损失承担责任。</strong>
                  </p>

                  <p>5.4&nbsp;“Circle”提供方将运用各种安全技术和程序建立完善的管理制度来保护用户的个人信息，以免遭受未经授权的访问、使用或披露。出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>

                  <p>5.5 “Circle”提供方不会将您的个人信息转移或披露给任何非关联的第三方，除非：</p>

                  <p>（1）获得您明确同意或基于您的主动选择；或</p>

                  <p>（2）基于法律法规规定的披露：在法律、法律程序、诉讼或政府主管部门的强制性要求。</p>

                  <p><strong>5.6</strong>&nbsp;<strong>根据法律法规规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。</strong>
                  </p>

                  <p>5.7 在以下情况下，“Circle”提供方可能会使用您的个人信息：</p>

                  <p>
                    （1）在进行促销或抽奖时，“Circle”提供方可能会与赞助商或合作伙伴共享用户的个人信息，在这些情况下“Circle”提供方会在发送用户信息之前进行提示，并且用户可以通过不参与促销或抽奖活动来终止传送过程；</p>

                  <p>（2）“Circle”提供方可能会与第三方合作向用户提供相关的网络服务，在此情况下，“Circle”提供方将要求该第三方承担与“Circle”提供方同等的保护用户隐私的责任；</p>

                  <p>（3）在不透露单个用户隐私资料的前提下，“Circle”提供方有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>

                  <p><strong>5.8&nbsp;未成年人使用我们的产品或服务应当取得监护人的同意。若您是未满十八周岁的未成年人，您在使用我们的产品或服务前应请您的父母或监护人仔细阅读本协议，并在取得您的父母或监护人的同意的前提下使用我们的产品或服务。</strong>
                  </p>

                  <h2><strong>6.&nbsp;服务的变更、中断和终止</strong></h2>

                  <p><strong>6.1&nbsp;用户理解并同意，</strong>“<strong>Circle”提供方提供的“Circle”产品和服务是按照现有技术和条件所能达到的现状提供的。</strong>“<strong>Circle”提供方会尽最大努力向您提供服务，确保服务的连贯性和安全性；但</strong>“<strong>Circle”提供方不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、网络环境、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。对于上述原因造成的用户数据损失，</strong>“<strong>Circle”提供方无须向用户或第三方负责或承担任何赔偿责任</strong>。如发生该等情形，“Circle”提供方将尽可能及时通过网页公告、系统通知、私信、短信提醒或其他合理方式向受影响的用户发送通知。
                  </p>

                  <p>6.2&nbsp;用户理解并同意，“Circle”提供方为了服务整体运营的需要，有权在不事先通知用户的情况下修改、中断、中止或终止“Circle”产品内的各项服务，而无须向用户或第三方负责或承担任何赔偿责任。“Circle”提供方也将尽可能事先向受影响的用户发出通知。</p>

                  <h2><strong>7.&nbsp;法律责任声明</strong></h2>

                  <p><strong>7.1&nbsp;</strong>“<strong>Circle”提供方对于任何您自“Circle”产品和服务中获得的他人的信息、内容或者广告宣传等任何资讯（以下统称“讯息”），不负保证真实、准确和完整性的责任。任何单位或者个人通过上述“讯息”而进行任何行为，须自行甄别真伪和谨慎预防风险，否则，无论何种原因，</strong>“<strong>Circle”提供方不对任何非与本应用程序直接发生的交易和（或）行为承担任何直接、间接、附带或衍生的损失和责任。</strong>
                  </p>

                  <p><strong>7.2 因客观情况及技术所限，请您理解：&nbsp;</strong>“<strong>Circle”提供方不保证产品和服务完全适合用户的使用要求；不保证产品或服务不受干扰，及时、安全、可靠，或不出现错误；不保证经由</strong>“<strong>Circle”提供方取得的任何产品、服务或其他材料符合用户的期望；不保证产品或服务中任何错误都将能得到更正。</strong>
                  </p>

                  <p><strong>7.3&nbsp;基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，</strong>“<strong>Circle”提供方不承担任何直接、间接、附带、特别、衍生性或惩罚性的赔偿责任</strong>：
                  </p>

                  <p>（1）对“Circle”提供方的产品的使用或无法使用；</p>

                  <p>（2）“Circle”提供方的产品不受干扰，及时、安全、可靠或不出现错误；用户经由“Circle”提供方取得的任何产品、服务或其他材料符合用户的期望；</p>

                  <p>（3）软件中的任何错误或不稳定；</p>

                  <p>（4）任何第三方在本软件服务中所作的声明或行为；</p>

                  <p>（5）用户基于在产品或服务中获取的广告信息，向第三方购买商品或服务；</p>

                  <p>（6）其他与“Circle”提供方相关的事宜，但本用户协议有明确规定的除外。</p>

                  <p>7.4&nbsp;对违反有关法律法规或本协议规定的行为，“Circle”提供方将依法律规定及上述规则等加以合理判断进行处理，对违法违规的任何人士采取适当的法律行动，并依据法律法规保存有关信息并向有关部门报告等。</p>

                  <p><strong>7.5&nbsp;&nbsp;“Circle”产品中可能包含由用户分享/上传的或</strong>“<strong>Circle”提供方以各种合法方式获取的外部网络内容或服务链接，您可以通过在“Circle”中获取的链接跳转到外部网页并在对应外部页面获取相关内容和服务。外部网页所涉及的服务可能需要您同时接受该服务特别制订的用户协议、使用协议或者其他约束您与该项服务提供者之间的法律文件。一旦您开始使用上述外部服务，则视为您同时接受有关单项服务的相关法律文件的约束。同时，关于您在这些外部服务中所产生的权利和义务，除非另有约定，</strong>“<strong>Circle”提供方无需向您或第三方的服务内容与效果承担任何责任。</strong>
                  </p>

                  <h2><strong>8.&nbsp;违约处理</strong></h2>

                  <p>8.1&nbsp;用户因违反国家法律法规或本协议的约定，或用户侵害他人任何权利因而衍生或导致任何第三人向“Circle”提供方提出任何索赔或请求，包括但不限于诉讼费用、律师费用、差旅费用、和解金额、罚款或生效法律文书中规定的损害赔偿金额、软件使用费等而给“Circle”提供方造成损失的，用户应赔偿“Circle”提供方因此而遭受的一切损失，并消除影响。</p>

                  <p>8.2&nbsp;如果“Circle”提供方发现或收到他人举报或投诉用户违反本协议约定的，“Circle”提供方有权在不经通知的情形下随时对相关内容进行删除、屏蔽，并视行为情节对违规账号处以包括但不限于警告、限制或禁止使用部分或全部功能、账号封禁直至注销的处罚，并有权公告处理结果。</p>

                  <p>8.3
                    您理解并同意，“Circle”有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行为，并依据法律法规保存有关信息向有关部门报告等，您应自行承担由此而产生的一切法律责任。</p>

                  <h2><strong>9.&nbsp;其他条款</strong></h2>

                  <p><strong>9.1&nbsp;</strong><strong>在此，我们再次提示您，您使用</strong><strong>“Circle”</strong><strong>产品和服务前应审慎阅读受本协议的约束并选择是否同意本协议的内容，您应在充分理解协议内容的前提下做出选择。选择同意则表示您已充分理解并同意签署本协议，承诺作为协议的一方当事人接受协议的约束。</strong><strong></strong>
                  </p>

                  <p>9.2&nbsp;本协议可能因国家政策、产品以及履行环境发生变化而进行修改，“Circle”提供方有权在必要时变更本协议条款，并在“Circle”提供方及“Circle”产品的相关页面公布最新版本的协议条款供您查阅。“Circle”提供方也可以选择其他适当的方式向您通知修改的内容，如在相关网站、页面或应用程序内进行通知。<strong>本协议条款变更后，如果您继续使用“Circle”产品和服务，即视为您已接受变更后的协议。如果您不接受变更后的协议，应当停止使用“Circle”产品和服务。</strong>
                  </p>

                  <p>9.3&nbsp;本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。本协议之任何规定无论因任何原因部分无效或不可执行，则这些条款将尽可能接近本协议原条文意旨重新解析，且本协议其它规定仍应具有完整的效力及效果。</p>

                  <p><strong>9.4
                    本协议的签署地点为上海市杨浦区，若用户因本协议项下的产品及服务与</strong>“<strong>Circle”提供方发生争议的，您可以优先同</strong>“<strong>Circle”提供方友好协商解决；协商不成的，双方同意将争议提交本协议签署地有管辖权的人民法院管辖。</strong>
                  </p>

                  <p>9.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
                </div><!-- .entry-content -->
              </article><!-- #post-## -->

            </main><!-- .site-main -->

          </div><!-- .content-area -->

        </div><!-- .site-content -->
      </div><!-- .site-inner -->
    </div><!-- .site -->
  </div>
</template>

<script>
export default {
  name: 'UserAgreement'
}
</script>

<style scoped>

  .site-branding {
    margin: 0 auto 0 0;
  }

  .site-branding .site-title,
  .site-description {
    clip: rect(1px, 1px, 1px, 1px);
    position: absolute;
  }

  body.custom-background {
    background-color: #ffffff;
  }

  img.wp-smiley,
  img.emoji {
    display: inline !important;
    border: none !important;
    box-shadow: none !important;
    height: 1em !important;
    width: 1em !important;
    margin: 0 .07em !important;
    vertical-align: -0.1em !important;
    background: none !important;
    padding: 0 !important;}
</style>
